RyanSpaceTrek/TestBoard/SpaceTrek_esp32_dev_module-1.0.0.zip/esp32/boards.txt
##############################################################
# Custom Slim ESP32 Dev Module
##############################################################

my_slim_esp32_dev.name=ESP32 Dev Module (Slim Custom)

my_slim_esp32_dev.bootloader.tool=esptool_py
my_slim_esp32_dev.bootloader.tool.default=esp32:esptool_py # Changed for referencing

my_slim_esp32_dev.upload.tool=esptool_py
my_slim_esp32_dev.upload.tool.default=esp32:esptool_py # Changed for referencing
my_slim_esp32_dev.upload.tool.network=esp_ota

my_slim_esp32_dev.upload.maximum_size=1310720
my_slim_esp32_dev.upload.maximum_data_size=327680
my_slim_esp32_dev.upload.flags=
my_slim_esp32_dev.upload.extra_flags=

my_slim_esp32_dev.serial.disableDTR=true
my_slim_esp32_dev.serial.disableRTS=true

my_slim_esp32_dev.build.tarch=xtensa # Note: Using tarch as per your input
my_slim_esp32_dev.build.bootloader_addr=0x1000
my_slim_esp32_dev.build.target=esp32
my_slim_esp32_dev.build.mcu=esp32
my_slim_esp32_dev.build.core=esp32:esp32 # Changed for referencing
my_slim_esp32_dev.build.variant=esp32:esp32 # Changed for referencing
my_slim_esp32_dev.build.board=ESP32_DEV # This can remain, it sets a compile-time macro ARDUINO_ESP32_DEV

my_slim_esp32_dev.build.f_cpu=240000000L
my_slim_esp32_dev.build.flash_size=4MB
my_slim_esp32_dev.build.flash_freq=40m
my_slim_esp32_dev.build.flash_mode=dio
my_slim_esp32_dev.build.boot=dio
my_slim_esp32_dev.build.partitions=default
my_slim_esp32_dev.build.defines=
my_slim_esp32_dev.build.loop_core=
my_slim_esp32_dev.build.event_core= # Note: Using event_core as per your input

## IDE 2.0 Seems to not update the value (Comment preserved)
my_slim_esp32_dev.menu.JTAGAdapter.default=Disabled
my_slim_esp32_dev.menu.JTAGAdapter.default.build.copy_jtag_files=0
my_slim_esp32_dev.menu.JTAGAdapter.external=FTDI Adapter
my_slim_esp32_dev.menu.JTAGAdapter.external.build.openocdscript=esp32-wrover-kit-3.3v.cfg
my_slim_esp32_dev.menu.JTAGAdapter.external.build.copy_jtag_files=1
my_slim_esp32_dev.menu.JTAGAdapter.bridge=ESP USB Bridge
my_slim_esp32_dev.menu.JTAGAdapter.bridge.build.openocdscript=esp32-bridge.cfg
my_slim_esp32_dev.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

my_slim_esp32_dev.menu.PSRAM.disabled=Disabled
my_slim_esp32_dev.menu.PSRAM.disabled.build.defines=
my_slim_esp32_dev.menu.PSRAM.disabled.build.extra_libs=
my_slim_esp32_dev.menu.PSRAM.enabled=Enabled
my_slim_esp32_dev.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue -mfix-esp32-psram-cache-strategy=memw
my_slim_esp32_dev.menu.PSRAM.enabled.build.extra_libs=

my_slim_esp32_dev.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
my_slim_esp32_dev.menu.PartitionScheme.default.build.partitions=default
my_slim_esp32_dev.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
my_slim_esp32_dev.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
my_slim_esp32_dev.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
my_slim_esp32_dev.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
my_slim_esp32_dev.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
my_slim_esp32_dev.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
my_slim_esp32_dev.menu.PartitionScheme.minimal.build.partitions=minimal
my_slim_esp32_dev.menu.PartitionScheme.no_fs=No FS 4MB (2MB APP x2)
my_slim_esp32_dev.menu.PartitionScheme.no_fs.build.partitions=no_fs
my_slim_esp32_dev.menu.PartitionScheme.no_fs.upload.maximum_size=2031616
my_slim_esp32_dev.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
my_slim_esp32_dev.menu.PartitionScheme.no_ota.build.partitions=no_ota
my_slim_esp32_dev.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
my_slim_esp32_dev.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
my_slim_esp32_dev.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
my_slim_esp32_dev.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
my_slim_esp32_dev.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
my_slim_esp32_dev.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
my_slim_esp32_dev.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
my_slim_esp32_dev.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
my_slim_esp32_dev.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
my_slim_esp32_dev.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
my_slim_esp32_dev.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
my_slim_esp32_dev.menu.PartitionScheme.huge_app.build.partitions=huge_app
my_slim_esp32_dev.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
my_slim_esp32_dev.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
my_slim_esp32_dev.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
my_slim_esp32_dev.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
my_slim_esp32_dev.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
my_slim_esp32_dev.menu.PartitionScheme.fatflash.build.partitions=ffat
my_slim_esp32_dev.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
my_slim_esp32_dev.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
my_slim_esp32_dev.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
my_slim_esp32_dev.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
my_slim_esp32_dev.menu.PartitionScheme.rainmaker=RainMaker 4MB
my_slim_esp32_dev.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
my_slim_esp32_dev.menu.PartitionScheme.rainmaker.upload.maximum_size=1966080
my_slim_esp32_dev.menu.PartitionScheme.rainmaker_4MB=RainMaker 4MB No OTA
my_slim_esp32_dev.menu.PartitionScheme.rainmaker_4MB.build.partitions=rainmaker_4MB_no_ota
my_slim_esp32_dev.menu.PartitionScheme.rainmaker_4MB.upload.maximum_size=4038656
my_slim_esp32_dev.menu.PartitionScheme.rainmaker_8MB=RainMaker 8MB
my_slim_esp32_dev.menu.PartitionScheme.rainmaker_8MB.build.partitions=rainmaker_8MB
my_slim_esp32_dev.menu.PartitionScheme.rainmaker_8MB.upload.maximum_size=4116480
my_slim_esp32_dev.menu.PartitionScheme.zigbee_zczr=Zigbee ZCZR 4MB with spiffs
my_slim_esp32_dev.menu.PartitionScheme.zigbee_zczr.build.partitions=zigbee_zczr
my_slim_esp32_dev.menu.PartitionScheme.zigbee_zczr.upload.maximum_size=1310720
my_slim_esp32_dev.menu.PartitionScheme.zigbee_zczr_8MB=Zigbee ZCZR 8MB with spiffs
my_slim_esp32_dev.menu.PartitionScheme.zigbee_zczr_8MB.build.partitions=zigbee_zczr_8MB
my_slim_esp32_dev.menu.PartitionScheme.zigbee_zczr_8MB.upload.maximum_size=3407872
my_slim_esp32_dev.menu.PartitionScheme.custom=Custom
my_slim_esp32_dev.menu.PartitionScheme.custom.build.partitions=
my_slim_esp32_dev.menu.PartitionScheme.custom.upload.maximum_size=16777216

my_slim_esp32_dev.menu.CPUFreq.240=240MHz (WiFi/BT)
my_slim_esp32_dev.menu.CPUFreq.240.build.f_cpu=240000000L
my_slim_esp32_dev.menu.CPUFreq.160=160MHz (WiFi/BT)
my_slim_esp32_dev.menu.CPUFreq.160.build.f_cpu=160000000L
my_slim_esp32_dev.menu.CPUFreq.80=80MHz (WiFi/BT)
my_slim_esp32_dev.menu.CPUFreq.80.build.f_cpu=80000000L
my_slim_esp32_dev.menu.CPUFreq.40=40MHz (40MHz XTAL)
my_slim_esp32_dev.menu.CPUFreq.40.build.f_cpu=40000000L
my_slim_esp32_dev.menu.CPUFreq.26=26MHz (26MHz XTAL)
my_slim_esp32_dev.menu.CPUFreq.26.build.f_cpu=26000000L
my_slim_esp32_dev.menu.CPUFreq.20=20MHz (40MHz XTAL)
my_slim_esp32_dev.menu.CPUFreq.20.build.f_cpu=20000000L
my_slim_esp32_dev.menu.CPUFreq.13=13MHz (26MHz XTAL)
my_slim_esp32_dev.menu.CPUFreq.13.build.f_cpu=13000000L
my_slim_esp32_dev.menu.CPUFreq.10=10MHz (40MHz XTAL)
my_slim_esp32_dev.menu.CPUFreq.10.build.f_cpu=10000000L

my_slim_esp32_dev.menu.FlashMode.qio=QIO
my_slim_esp32_dev.menu.FlashMode.qio.build.flash_mode=dio
my_slim_esp32_dev.menu.FlashMode.qio.build.boot=qio
my_slim_esp32_dev.menu.FlashMode.dio=DIO
my_slim_esp32_dev.menu.FlashMode.dio.build.flash_mode=dio
my_slim_esp32_dev.menu.FlashMode.dio.build.boot=dio

my_slim_esp32_dev.menu.FlashFreq.80=80MHz
my_slim_esp32_dev.menu.FlashFreq.80.build.flash_freq=80m
my_slim_esp32_dev.menu.FlashFreq.40=40MHz
my_slim_esp32_dev.menu.FlashFreq.40.build.flash_freq=40m

my_slim_esp32_dev.menu.FlashSize.4M=4MB (32Mb)
my_slim_esp32_dev.menu.FlashSize.4M.build.flash_size=4MB
my_slim_esp32_dev.menu.FlashSize.8M=8MB (64Mb)
my_slim_esp32_dev.menu.FlashSize.8M.build.flash_size=8MB
my_slim_esp32_dev.menu.FlashSize.2M=2MB (16Mb)
my_slim_esp32_dev.menu.FlashSize.2M.build.flash_size=2MB
my_slim_esp32_dev.menu.FlashSize.16M=16MB (128Mb)
my_slim_esp32_dev.menu.FlashSize.16M.build.flash_size=16MB

my_slim_esp32_dev.menu.UploadSpeed.921600=921600
my_slim_esp32_dev.menu.UploadSpeed.921600.upload.speed=921600
my_slim_esp32_dev.menu.UploadSpeed.115200=115200
my_slim_esp32_dev.menu.UploadSpeed.115200.upload.speed=115200
my_slim_esp32_dev.menu.UploadSpeed.256000.windows=256000
my_slim_esp32_dev.menu.UploadSpeed.256000.upload.speed=256000
my_slim_esp32_dev.menu.UploadSpeed.230400.windows.upload.speed=256000
my_slim_esp32_dev.menu.UploadSpeed.230400=230400
my_slim_esp32_dev.menu.UploadSpeed.230400.upload.speed=230400
my_slim_esp32_dev.menu.UploadSpeed.460800.linux=460800
my_slim_esp32_dev.menu.UploadSpeed.460800.macosx=460800
my_slim_esp32_dev.menu.UploadSpeed.460800.upload.speed=460800
my_slim_esp32_dev.menu.UploadSpeed.512000.windows=512000
my_slim_esp32_dev.menu.UploadSpeed.512000.upload.speed=512000

my_slim_esp32_dev.menu.LoopCore.1=Core 1
my_slim_esp32_dev.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
my_slim_esp32_dev.menu.LoopCore.0=Core 0
my_slim_esp32_dev.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

my_slim_esp32_dev.menu.EventsCore.1=Core 1
my_slim_esp32_dev.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
my_slim_esp32_dev.menu.EventsCore.0=Core 0
my_slim_esp32_dev.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

my_slim_esp32_dev.menu.DebugLevel.none=None
my_slim_esp32_dev.menu.DebugLevel.none.build.code_debug=0
my_slim_esp32_dev.menu.DebugLevel.error=Error
my_slim_esp32_dev.menu.DebugLevel.error.build.code_debug=1
my_slim_esp32_dev.menu.DebugLevel.warn=Warn
my_slim_esp32_dev.menu.DebugLevel.warn.build.code_debug=2
my_slim_esp32_dev.menu.DebugLevel.info=Info
my_slim_esp32_dev.menu.DebugLevel.info.build.code_debug=3
my_slim_esp32_dev.menu.DebugLevel.debug=Debug
my_slim_esp32_dev.menu.DebugLevel.debug.build.code_debug=4
my_slim_esp32_dev.menu.DebugLevel.verbose=Verbose
my_slim_esp32_dev.menu.DebugLevel.verbose.build.code_debug=5

my_slim_esp32_dev.menu.EraseFlash.none=Disabled
my_slim_esp32_dev.menu.EraseFlash.none.upload.erase_cmd=
my_slim_esp32_dev.menu.EraseFlash.all=Enabled
my_slim_esp32_dev.menu.EraseFlash.all.upload.erase_cmd=-e

my_slim_esp32_dev.menu.ZigbeeMode.default=Disabled
my_slim_esp32_dev.menu.ZigbeeMode.default.build.zigbee_mode=
my_slim_esp32_dev.menu.ZigbeeMode.default.build.zigbee_libs=
my_slim_esp32_dev.menu.ZigbeeMode.zczr=Zigbee ZCZR (coordinator/router)
my_slim_esp32_dev.menu.ZigbeeMode.zczr.build.zigbee_mode=-DZIGBEE_MODE_ZCZR
my_slim_esp32_dev.menu.ZigbeeMode.zczr.build.zigbee_libs=-lesp_zb_api.zczr -lzboss_stack.zczr -lzboss_port.remote
